yisea123/stm32project/Cood/bsp/Src/dma.c
/**
  ******************************************************************************
  * File Name          : dma.c
  * Description        : This file provides code for the configuration
  *                      of all the requested memory to memory DMA transfers.
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "dma.h"
#include "stm32f4xx_it.h"
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/*----------------------------------------------------------------------------*/
/* Configure DMA                                                              */
/*----------------------------------------------------------------------------*/

/* USER CODE BEGIN 1 */

/* USER CODE END 1 */

/** 
  * Enable DMA controller clock
  */
void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream0_IRQn interrupt configuration */
  /* SPI 3 -> AD chip for reference */
  HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, ISR_PRIORITY_SPI_AD_DMA, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

  /* IIC */
  /* DMA1_Stream2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, ISR_PRIORITY_I2C2_DMA, 1);
  HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);


  /* Uart 3 Tx*/
  /* DMA1_Stream3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, ISR_PRIORITY_DMA, 2);
  HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);


  /* SPI 3 -> AD chip for reference */
  /* DMA1_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, ISR_PRIORITY_SPI_AD_DMA, 3);
  HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);


  /* Uart 2 Tx*/
  /* DMA1_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, ISR_PRIORITY_DMA, 4);
  HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

  /* IIC */
  /* DMA1_Stream7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, ISR_PRIORITY_I2C2_DMA, 5);
  HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);

  /* SPI 4 -> spi flash Rx*/
  /* DMA2_Stream0_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, ISR_PRIORITY_DMA, 6);
  HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);


  /* DMA2_Stream1_IRQn interrupt configuration */
  /* SPI 4 -> spi flash Tx*/
  HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, ISR_PRIORITY_DMA, 7);
  HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

  /* SPI 5 -> AD chip for temperature */
  /* DMA2_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, ISR_PRIORITY_DMA, 8);
  HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);

  /* SPI 5 -> AD chip for temperature */
  /* DMA2_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, ISR_PRIORITY_DMA, 9);
  HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);

  /* SPI 6 -> AD chip for measure */
  /* DMA2_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, ISR_PRIORITY_SPI_AD_DMA, 8);
  HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);

  /* SPI 6 -> AD chip for measure */
  /* DMA2_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, ISR_PRIORITY_SPI_AD_DMA, 9);
  HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);

  /* Uart 1 Tx*/
  /* DMA2_Stream7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, ISR_PRIORITY_DMA, 10);
  HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
}

/* USER CODE BEGIN 2 */

/* USER CODE END 2 */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
